<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>014 Урок 14 Классический цикл «for». Выражения «break» и «continue».mp4</title>
</head>
<body>
<H1>Цикл For</H1>
<br>
<h3>Вопросы:</h3><br>
1) Для чего предназначен цикл For?<br>
<br>
Для неоднократного использования како-го либо кода с возможностью конкретного указания сколько раз выполниться код.<br>
<br>
2) Можно ли использовать вложенные циклы For?<br>
<br>
Можно<br>
<br>
3) Синтаксис цикла For?<br>
<br>
for( int i = 0; i < 10; i++){<br>
...<br>
какие либо действия<br>
...<br>
}<br>
<br>
4) какие типы данных можно использовать в блоке инициализации?<br>
ЛЮБЫЕ!!!!<br>
<br>
5) Область видимости переменных цикла, можно ли использовать внешние по отношению к циклу переменные в качестве
счетчика?<br>
<br>
Можно.<br>
<br>
6) Можно ли создать бесконечный цикл For?<br>
Можно for( ;;){}<br>
<br>
7) Можно ли использовать несколько переменных счетчиков в цикле?<br>
Можно<br>
for(int i=0, j=0; i < 10 && j < 100; i++,j=j+10){<br>
    ...<br>
}<br>
<br>
<br>
8) Что такое unreacheable statement?<br>

    Недостижимый в рамках логики программы код. Вызывает ошибку компиляции. if() - это исключение из правил<br><br>
9) Для чего служит ключевое слово break?<br>
    Для прерывания либо текущего цикла либо прерывание сцикла по метке.<br>
<br>
10) Для чего служит ключевое слово continue?<br>
    Для перехода к следующей итерации текущего цикла либо цикла по метке.<br>
<br>
<br>
<h3>Задачи:</h3><br>
<font size="4">
<pre>
1) вывести на экран строку "Я изучаю циклы" 10 раз!

ОТВЕТ:

public static void main(String[] args) {
for (int i = 0; i < 10; i++) {
    System.out.println("Я изучаю циклы");
}
}

2) улучшить 1-ю задачу чтоб на каждую 2-ю выведенную строку к строке добавлялось "!!!"
Я изучаю циклы
Я изучаю циклы!!!
Я изучаю циклы
Я изучаю циклы!!!
Я изучаю циклы
Я изучаю циклы!!!
Я изучаю циклы
Я изучаю циклы!!!
Я изучаю циклы
Я изучаю циклы!!!


ОТВЕТ:

public static void main(String[] args) {
    for (int i = 0; i < 10; i++) {
        System.out.print("Я изучаю циклы");
        if((i+1)%2==0){
            System.out.println("!!!");
        } else {
            System.out.println();
        }
    }
}

3) Создать метод который выводит таблицу умножения от 1 до 9 умноженный на переданный параметр.

public static void umn(int parametr){
//здесь ваш код
}

ОТВЕТ:

public static void umn(int parametr){
    for (int j = 1; j < 10; j++) {
    System.out.println(parametr+" * "+ j + " = "+parametr*j);
    }
}

например если передали в параметр 1 вывод должен быть такой:
1 * 1 = 1
1 * 2 = 2
1 * 3 = 3
1 * 4 = 4
1 * 5 = 5
1 * 6 = 6
1 * 7 = 7
1 * 8 = 8
1 * 9 = 9


4)написать программу используя предыдущий метод для вывода всей таблицы умножения
вывод должен быть такой:
1 * 1 = 1
1 * 2 = 2
1 * 3 = 3
1 * 4 = 4
1 * 5 = 5
1 * 6 = 6
1 * 7 = 7
1 * 8 = 8
1 * 9 = 9

2 * 1 = 2
2 * 2 = 4
2 * 3 = 6
2 * 4 = 8
2 * 5 = 10
2 * 6 = 12
2 * 7 = 14
2 * 8 = 16
2 * 9 = 18

3 * 1 = 3
3 * 2 = 6
3 * 3 = 9
3 * 4 = 12
3 * 5 = 15
3 * 6 = 18
3 * 7 = 21
3 * 8 = 24
3 * 9 = 27

4 * 1 = 4
4 * 2 = 8
4 * 3 = 12
4 * 4 = 16
4 * 5 = 20
4 * 6 = 24
4 * 7 = 28
4 * 8 = 32
4 * 9 = 36

5 * 1 = 5
5 * 2 = 10
5 * 3 = 15
5 * 4 = 20
5 * 5 = 25
5 * 6 = 30
5 * 7 = 35
5 * 8 = 40
5 * 9 = 45

6 * 1 = 6
6 * 2 = 12
6 * 3 = 18
6 * 4 = 24
6 * 5 = 30
6 * 6 = 36
6 * 7 = 42
6 * 8 = 48
6 * 9 = 54

7 * 1 = 7
7 * 2 = 14
7 * 3 = 21
7 * 4 = 28
7 * 5 = 35
7 * 6 = 42
7 * 7 = 49
7 * 8 = 56
7 * 9 = 63

8 * 1 = 8
8 * 2 = 16
8 * 3 = 24
8 * 4 = 32
8 * 5 = 40
8 * 6 = 48
8 * 7 = 56
8 * 8 = 64
8 * 9 = 72

9 * 1 = 9
9 * 2 = 18
9 * 3 = 27
9 * 4 = 36
9 * 5 = 45
9 * 6 = 54
9 * 7 = 63
9 * 8 = 72
9 * 9 = 81


ОТВЕТ:

public static void main(String[] args) {
    tabl();
}
public static void tabl(){
    for (int i = 1; i < 10; i++) {
        umn(i);
        System.out.println();
    }
}

public static void umn(int parametr){
    for (int j = 1; j < 10; j++) {
        System.out.println(parametr+" * "+ j + " = "+parametr*j);
    }
}

5) написать метод печатающий таблицу пифагора:

1 2 3 4 5 6 7 8 9
2 4 6 8 10 12 14 16 18
3 6 9 12 15 18 21 24 27
4 8 12 16 20 24 28 32 36
5 10 15 20 25 30 35 40 45
6 12 18 24 30 36 42 48 54
7 14 21 28 35 42 49 56 63
8 16 24 32 40 48 56 64 72
9 18 27 36 45 54 63 72 81

ОТВЕТ:

public static void main(String[] args) {
    pifagor();
}

public static void pifagor(){
    for (int i = 1; i < 10; i++) {
        for (int j = 1; j < 10; j++) {
            System.out.print(i*j+" ");
        }
        System.out.println();
    }
}


5*) загуглить материал по методу System.out.printf()
улучшить программу печатающую таблицу пифагора чтоб было красиво используя по 4 знакоместа на каждое число.

1   2   3   4   5   6   7   8   9
2   4   6   8  10  12  14  16  18
3   6   9  12  15  18  21  24  27
4   8  12  16  20  24  28  32  36
5  10  15  20  25  30  35  40  45
6  12  18  24  30  36  42  48  54
7  14  21  28  35  42  49  56  63
8  16  24  32  40  48  56  64  72
9  18  27  36  45  54  63  72  81

ОТВЕТ:

public static void main(String[] args) {
    pifagor();
}

public static void pifagor(){
    for (int i = 1; i < 10; i++) {
        for (int j = 1; j < 10; j++) {
            System.out.printf("%4d",i*j);
        }
        System.out.println();
    }
}
</pre>
</font>
</body>
</html>